import os
from dotenv import load_dotenv

load_dotenv()

API_ID = os.getenv("API_ID")
API_HASH = os.getenv("API_HASH")
BOT_TOKEN = os.getenv("BOT_TOKEN")

CHANNELS_TO_MONITOR = ["tviy_kyiv", "kiev1", -1003740116044, -1004298960926]

# Точні фрази, які завжди означають загрозу (тільки балістика/ракети)
EXACT_THREATS = [
    "загроза балістики", "загроза застосування балістичного", "ракетна небезпека", 
    "пуски ракет", "балістика на", "швидкісна на", "швидкісна ціль", 
    "зліт міг", "ракетна атака", "рух ракет", "пуск балістики"
]

# Ключові слова зброї
WEAPONS = ["балістик", "циркон", "кинджал", "кинжал", "іскандер", "швидкісн", "ракет"]

# Ключові слова, що вказують на активну дію/попередження
ACTION_WORDS = ["загроза", "увага", "пуск", "рух", "напрям", "тривога", "небезпека", "зліт", "летить", "укриття"]

# Слова-маркери новин, зведень або наслідків (ігноруємо повідомлення)
IGNORE_WORDS = ["знищено", "збито", "відбито", "наслідки", "втрати", "підсумки", "зведення", "вчора", "минулої", "ніч", "інформація", "отрима"]

CLEAR_WORDS = ["відбій", "чисто", "дорозвідка"]
