import os
from dotenv import load_dotenv

load_dotenv()

API_ID = os.getenv("API_ID")
API_HASH = os.getenv("API_HASH")
BOT_TOKEN = os.getenv("BOT_TOKEN")

CHANNELS_TO_MONITOR = ["tviy_kyiv", "kiev1", -1003740116044, -1004298960926]

# Точні фрази, які завжди означають загрозу
EXACT_THREATS = [
    r"загроза\s+балістики", 
    r"загроза\s+застосування\s+балістичного", 
    r"ракетна\s+небезпека", 
    r"пуск\w*\s+ракет", 
    r"балістика\s+на\b", 
    r"швидкісна\s+на\b", 
    r"швидкісна\s+ціль", 
    r"зліт\s+міг", 
    r"ракетна\s+атака", 
    r"рух\s+ракет", 
    r"пуск\s+балістики"
]

# Ключові слова зброї (будуть перевірятися разом з діями)
WEAPONS = [
    r"балістик", r"циркон", r"кинджал", r"кинжал", r"іскандер", r"швидкісн", r"ракет"
]

# Ключові слова, що вказують на активну дію/попередження
ACTION_WORDS = [
    r"загроза", r"увага", r"\bпуск", r"\bрух", r"\bнапрям(ок|ку|ком)?\b", r"тривога", r"небезпека", r"зліт", r"летить", r"укриття"
]

# Слова, що повністю скасовують тривогу (звіти, наслідки)
CANCEL_WORDS = [
    r"знищено", r"збито", r"відбито", r"наслідки", r"втрати", r"підсумки", 
    r"зведення", r"вчора", r"минулої", r"\bночі\b", r"\bніч\b"
]

# Слова, що вказують на новини (відміняють слабкі комбінації, але пропускають точні загрози)
NEWS_WORDS = [
    r"інформаці", r"отрима", r"запас", r"ресурс", r"повідомляється", r"моніторинг", r"поповнили", r"озброєнн"
]

# Слова відбою (розм'ючують користувачів)
CLEAR_WORDS = [
    r"відбій", r"чисто", r"дорозвідка"
]
