import os
from dotenv import load_dotenv

load_dotenv()

API_ID = os.getenv("API_ID")
API_HASH = os.getenv("API_HASH")
BOT_TOKEN = os.getenv("BOT_TOKEN")

CHANNELS_TO_MONITOR = [-1004298960926, -1001223955273] # "tviy_kyiv", "kiev1", -1003740116044

# Базові корені слів та фрази, які означають пряму загрозу
EXACT_THREATS = [
    # 🔴 Балістика
    "баліст", # охоплює: балістика, балістична, загроза балістики
    "іскандер",
    "kn-23",

    # 🚀 Ракети загалом
    "ракет", # охоплює: ракета, ракети, ракетна, пуск ракет
    "крилат", # охоплює: крилата, крилаті

    # ☄️ Швидкісні та аеробалістичні цілі
    "швидкісн", # охоплює: швидкісна, швидкісні
    "зліт міг",
    "кинджал",
    "х-47м2",
    "циркон",

    # ✈️ Специфічні типи ракет
    "х-101",
    "х-59",
    "х-69",
    "калібр",

    # 🛸 Ударні дрони (БПЛА)
    # "шахед",
    # "ударн",
    # "бпла",

    # 💥 Авіабомби (КАБ)
    # "каб ",
    # "каби ",
    # "пуски каб",

    # ⚠️ Загальні заклики
    "загроз", # охоплює: загроза, пряма загроза
    "укриття", # охоплює: в укриття, йдіть в укриття
]

# Слова, що виключають тривогу (новини, звіти про збиття, інформаційні пости)
EXCLUDE_WORDS = [
    # 🛡 Звіти ППО
    "знищен", # знищено, знищені
    "збит", # збито, збиті
    "відбит", # відбито, відбита
    
    # 📰 Новини та підсумки
    "наслідк",
    "втрат",
    "підсумк",
    "зведенн",
    
    # 🕒 Часові маркери минулого
    "вчора",
    "минул", # минулої, минулого
    "ночі",
    "ніч",
    "станом на",
    
    # ℹ️ Інформаційні слова
    "інформац", # інформація, інформаційні
    "отрима", # отримано, отримали
    "запас",
    "ресурс",
    "повідомля", # повідомляється, повідомляють
    "моніторинг",
    "поповнил",
    "озброєнн",

    "активн",
    "прифронтов"
]

# Слова відбою тривоги
CLEAR_WORDS = [
    "відбій",
    "чисто",
    "дорозвідка",
    "небо чисте",
]
