import os
from dotenv import load_dotenv

load_dotenv()

API_ID = os.getenv("API_ID")
API_HASH = os.getenv("API_HASH")
BOT_TOKEN = os.getenv("BOT_TOKEN")

CHANNELS_TO_MONITOR = [-1004298960926, -1001223955273] # "tviy_kyiv", "kiev1", -1003740116044

# Точні слова та фрази, які означають пряму загрозу
EXACT_THREATS = [
    # 🔴 Балістика
    "загроза баліст",
    "балістика на",
    "балістика з",
    "балістика через",
    "іскандер",
    "kn-23",

    # 🚀 Ракети загалом
    "ракетна небезпека",
    "ракетна атака",
    "пуск ракет",
    "пуски ракет",
    "рух ракет",
    "крилата ракета",
    "крилаті ракети",

    # ☄️ Швидкісні та аеробалістичні цілі
    "швидкісна на",
    "швидкісна ціль",
    "зліт міг",
    "кинджал",
    "х-47м2",
    "циркон",

    # ✈️ Специфічні типи ракет
    "х-101",
    "х-59",
    "х-69",
    "калібр",

    # 🛸 Ударні дрони (БПЛА)
    # "шахед на",
    # "шахеди на",
    # "ударний бпла",
    # "ударні бпла",

    # 💥 Авіабомби (КАБ)
    # "пуски каб",
    # "каб на",
    # "каби на",

    # ⚠️ Загальні заклики
    "пряма загроза",
    "в укриття",
]

# Слова, що виключають тривогу (новини, звіти про збиття, інформаційні пости)
EXCLUDE_WORDS = [
    # 🛡 Звіти ППО
    "знищено",
    "збито",
    "відбито",
    
    # 📰 Новини та підсумки
    "наслідки",
    "втрати",
    "підсумки",
    "зведення",
    
    # 🕒 Часові маркери минулого
    "вчора",
    "минулої",
    "ночі",
    "ніч",
    "станом на",
    
    # ℹ️ Інформаційні слова
    "інформаці",
    "отрима",
    "запас",
    "ресурс",
    "повідомляється",
    "моніторинг",
    "поповнили",
    "озброєнн",
]

# Слова відбою тривоги
CLEAR_WORDS = [
    "відбій",
    "чисто",
    "дорозвідка",
    "небо чисте",
]
